Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: །གོས་ཀྱི་ཕུང་པོ་རི་ཙམ་དག་སྦྱིན་པར་བྱེད་དོ། །བཟའ་བ་དང་། བཅའ་བའི་ཕུང་པོ་རི་ཙམ་དག་སྦྱིན་པ་སྦྱིན་པར་བྱེད་དེ།
en: He was also donating a mountain of fabrics and distributing food and drinks to others, likewise the size of a mountain.

source: སེམས་ཅན་གང་དག་གིས་ཕ་བི་ལས་ཁྱེར་བ་དེ་དག་ལ་སྦྱིན་པ་བྱིན་པར་གྱུར་ཅིག་ཅེས་སྒྲོགས་སོ།
en: To everyone who carried his gifts away he would call out, “Please be generous!”

source: །གཞན་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་བཀའ་སྩལ་པ། བྱང་ཆུབ་སེམས་དཔའ་ཐོགས་པ་མེད་པས་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་རྟ་འབུམ་ཕྲག་མང་པོ་བཀྲམ་སྟེ་ཤིང་རྟ་རེ་རེ་ལ་ཡང་བུད་མེད་ཁ་དོག་སྟོང་གིས་བརྒྱན་པ་དག་བསྐྱོན་ནས།
en: The Blessed One spoke to Venerable Śāradvatīputra, “The bodhisattva Unhindered has also lined up several hundred thousand chariots filled with the seven precious substances. On each chariot he has placed a lady who is adorned with thousands of colors.

source: ཚོང་འདུས་ཀྱི་སྲང་དུ་སྦྱིན་པར་བྱེད་དེ། ཚིག་འདི་སྐད་དུ་གང་ཤིང་རྟ་འདི་དག་དང་། བུད་མེད་འདི་དག་འདོད་པ་དེས་ཁྱེར་ཅིག་ཅེས་ཀྱང་ཟེར་རོ།
en: In the market street he offers all of these as gifts, calling out, ‘Whoever desires these chariots and these women can carry them off!’

source: །བུད་མེད་དེ་དག་རེ་རེ་ཡང་བུད་མེད་བརྒྱ་བརྒྱའི་འཁོར་དང་ལྡན་ཏེ།
en: And along with each of the women follows a retinue of hundreds of maidens.

source: ཤིང་རྟ་དབྱིག་དང་བཅས་པ་བུད་མེད་ཀྱི་འཁོར་དང་བཅས་པ་དེ་བུད་མེད་དེ་དག་ལ་སྦྱིན་པར་བྱེད་ཅིང་ཡོངས་སུ་གཏོང་ངོ་།
en: He gives away all of these chariots loaded with riches as well as all the ladies and their retinues of maidens.

source: །ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཐོགས་པ་མེད་པ་སྦྱིན་པ་སྦྱིན་པ་མཐོང་ངམ།
en: Śāradvatīputra, do you see the bodhisattva Unhindered practicing generosity in this way?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ།
en: Śāradvatīputra replied, “Yes, Blessed One, I see it!

source: །བདེ་བར་གཤེགས་པ་མཐོང་ལགས་སོ།
en: Well-Gone One, I see it!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ།
en: The Blessed One said, “Śāradvatīputra, this is how bodhisattva great beings should practice generosity.”

source: །དེ་ནས་ཉན་ཐོས་ཆེན་པོ་དེ་དག་གིས་ཀྱང་སངས་རྒྱས་ཀྱི་མཐུས་སྦྱིན་པ་སྦྱིན་པ་དེ་མཐོང་ངོ་།
en: Through the Buddha’s power, the great hearers also witnessed the practice of generosity.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། སྦྱིན་པ་འདི་རྒྱ་ཆེ་བ་ཡིན་ནམ།
en: At that point the Blessed One said to Venerable Śāradvatīputra, “Śāradvatīputra, tell me, is this an immense act of generosity?”

source: གསོལ་པ། ཨ་ལ་ལ་བཅོམ་ལྡན་འདས་རྒྱ་ཆེ་བ་ལགས་སོ། །
en: Śāradvatīputra replied, “Oh my, Blessed One! It is truly immense!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་སྦྱིན་པ་འདི་ལྟར་བྱིན་ཞིང་ཡོངས་སུ་བཏང་བ་འདི་ལ་དེ་ལས་གཞན་པའི་སྦྱིན་པ་རྣམས་ནི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས། རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དོ།
en: The Blessed One said, “Śāradvatīputra, comparatively, other acts of generosity do not constitute even one percent of this generosity and liberality. Nor do they measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that. In fact, no number, fraction, enumeration, analogy, or comparison would suffice.”

source: །དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་སྦྱིན་པ་དེ་བྱིན་ནས། འདི་སྐད་དུ་དགེ་བའི་རྩ་བ་འདིས་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ནི་ཕྱིར་མི་ལྡོག་པ་ཉིད་དུ་གྱུར་ཅིག །
en: Through the Buddha’s power, Venerable Śāradvatīputra witnessed how the bodhisattva, after having given away all the gifts, dedicated the merit with the words, “By these roots of virtue may all bodhisattvas who have newly entered this vehicle reach the state of nonregression!

source: ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ཡིན་པ་དེ་དག་ནི་མྱུར་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེས་ཡོངས་སུ་སྔོ་བར་བྱེད་པ་ཡང་མཐོང་ངོ་།
en: And may all nonregressing bodhisattva great beings swiftly perfect the state of omniscience!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་བགྱི།
en: Venerable Śāradvatīputra asked the Blessed One, “Blessed One, what is meant by ‘bodhisattvas who have newly entered this vehicle?’ ”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དང་པོ་བསྐྱེད་པ།
en: The Blessed One replied, “Śāradvatīputra, it refers to bodhisattvas who arouse the mind of awakening for the first time.

source: སེམས་དང་པོ་བསྐྱེད་པ་ལ་གནས་པ་ནི་དགྲ་བཅོམ་པའི་སེམས་ལས་འདའོ།
en: As they form the mind of awakening for the first time, they transcend the attitude of the worthy ones.

source: །སེམས་གཉིས་པ་བསྐྱེད་པ་ནི་རང་སངས་རྒྱས་ཀྱི་སེམས་ལས་འདའོ།
en: By forming the mind of awakening for the second time, they transcend the attitude of the solitary buddhas.

source: །ཕྱིར་མི་ལྡོག་པའི་སེམས་ལ་གནས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་མ་ངེས་ཤིང་ལུང་མ་བསྟན་པའི་སེམས་ལས་འདའོ།
en: When the mind of awakening has become nonregressing, they transcend the mind of uncertain and indeterminate bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཞེས་བྱའོ།
en: When bodhisattvas sit at the seat of awakening, they are omniscient.

source: །ཤ་ར་དྭ་ཏིའི་བུ་གང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་ལ། ཐམས་ཅད་མཁྱེན་པ་མ་ཐོབ་པར་དེ་ལས་ལྡང་བ་འདི་ནི་མི་སྲིད་དེ།
en: Śāradvatīputra, whoever sits at the seat of awakening has attained omniscience from which they cannot possibly regress.

source: གོ་སྐབས་མ་ཡིན་ཞིང་གནས་མེད་དེ། མ་བྱུང་འབྱུང་བར་མི་འགྱུར་རོ།
en: There is no chance or basis for regressing from it; it has never happened and it never will.

source: །ཤ་ར་དྭ་ཏིའི་བུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པ་དེའི་ཚེ། ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་དང་། བདུད་དང་བཅས། ཚངས་པ་དང་བཅས། ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་སོ་ཞེས་རིག་པར་བྱའོ།
en: Śāradvatīputra, whenever bodhisattva great beings sit at the seat of awakening, the world, with its gods, demons, Brahmā, divine beings, humans, and asuras, is aware that the Thus-Gone One sits at the seat of awakening.

source: འདི་ལྟར་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྣག་པ་ཡོངས་སུ་རྫོགས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་སྐལ་བ་ཅན་དུ་གྱུར་པའི་ཕྱིར་རོ།
en: Because at that time bodhisattva great beings are fulfilling their goal and have become worthy of awakening to unsurpassed and perfect buddhahood.”

source: །དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དང་། ཉན་ཐོས་དེ་དག་གིས་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མེད་པ་གང་དག་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེ་དག་ཀྱང་མཐོང་ངོ་།
en: Through the Buddha’s power, Venerable Śāradvatīputra and all the hearers witnessed how, in all the worlds in the eastern direction, countless bodhisattva great beings were sitting at the seat of awakening, awakening to unsurpassed and perfect buddhahood.

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་རབ་ཏུ་འབྱུང་བའི་ཕྱིར་མངོན་པར་འབྱུང་བ་དག་ཀྱང་མཐོང་ངོ་།
en: They saw countless bodhisattvas leaving their homes in order to go forth.

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་ཁྱིམ་ན་གནས་ཤིང་སྦྱིན་པ་གཏོང་བ་དག་ཀྱང་མཐོང་ངོ་།
en: They saw countless bodhisattvas living as householders and practicing generosity.

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་སློང་བ་རྣམས་སློང་བ་ན། མགོ་ཡོངས་སུ་གཏོང་བ་དག་ཀྱང་མཐོང་ངོ་།
en: They saw that countless bodhisattvas would give away their own heads when requested by beggars.

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་སློང་བ་རྣམས་སློང་བ་ན། ལུས་འབིགས་སུ་བཅུག་སྟེ། ཁྲག་སྦྱིན་པ་དག་ཀྱང་མཐོང་ངོ་།
en: They saw how countless bodhisattvas, when requested by beggars, would pierce their own bodies and give away their blood.

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་བུ་དང་ཆུང་མ་ཡོངས་སུ་གཏོང་བ་དང་། ཁྱིམ་གྱི་དངོས་པོ་དང་། ཞིང་གི་དངོས་པོ་དང་། རྟ་དང་། བ་ལང་དང་། བྲན་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་རྣམས་ཡོངས་སུ་གཏོང་བ་དག་ཀྱང་མཐོང་ངོ་། །
en: They saw that countless bodhisattvas would give away their children, wives, and their household possessions, everything in their fields, and their horses, oxen, male and female servants, workers, and advisers.

source: བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་བྱེད་པ་དག་ཀྱང་མཐོང་ངོ་།
en: They saw countless bodhisattvas become Śakra, lord of the gods.

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་དགའ་ལྡན་གྱི་ལྷའི་རིས་སུ་སྐྱེ་བ་དག་ཀྱང་མཐོང་ངོ་།
en: They saw that countless bodhisattvas took birth in the divine realm of the Heaven of Joy.

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་དགའ་ལྡན་གྱི་གནས་ནས་ཤི་འཕོས་ཏེ། མའི་མངལ་དུ་སྐྱེ་བ་དག་ཀྱང་མཐོང་ངོ་།
en: They saw that countless bodhisattvas who had taken birth in the Heaven of Joy died and were reborn in the womb of a human mother.

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་བཙའ་བ་དང་ཆོས་སྟོན་པ་དག་ཀྱང་མཐོང་ངོ་།
en: They saw that countless bodhisattvas were born and taught the Dharma.

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་སྡུག་བསྔལ་རྣམས་ཡང་དང་ཡང་མྱོང་བ་དག་ཀྱང་མཐོང་ངོ་། །
en: They saw that countless bodhisattvas took suffering upon themselves for the sake of others.

source: བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་དཔག་ཚད་བརྒྱར་ཡང་འགྲོ་ཞིང་། ཉིས་བརྒྱའམ། སུམ་བརྒྱའམ། བཞི་བརྒྱའམ། ལྔ་བརྒྱའམ། དཔག་ཚད་སྟོང་ངམ། དེ་ལས་ལྷག་པར་ཡང་འགྲོ་བ་དང་།
en: They saw that countless bodhisattvas, for the sake of others, would travel one hundred, two hundred, three hundred, four hundred, five hundred, or one thousand leagues, and even farther than that.

source: སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་ཇི་ལྟར་བྱས་ན། སེམས་ཅན་འགའ་ཡང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དག་ལ་གནས་པར་འགྱུར་བར་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་དང་། ཡང་ན་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བར་འགྱུར་བར་འདི་ལ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་བྱ་བ་དང་། ཡང་ན་བསླབ་པའི་གཞི་གཅིག་འཛིན་པར་འགྱུར་བའམ། ཡང་ན་བསླབ་པའི་གཞི་གཉིས་སམ། གསུམ་མམ། བཞིའམ། ལྔ་འཛིན་པར་འགྱུར་བའམ།
en: These bodhisattvas would even travel throughout countless worlds in order to inspire others to practice the path of the ten virtuous actions; to take refuge in the Three Jewels; to keep one, two, three, four, or five of the foundations for training; and to dwell in awakening.

source: ཡང་ན་སེམས་ཅན་འགའ་ཡང་བྱང་ཆུབ་ལ་གནས་པར་འགྱུར་བར་ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་བྱ་བའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་དག་ཏུ་འགྲོ་བ་ཡང་མཐོང་ངོ་། །བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་གཞན་མུ་སྟེགས་ཅན་ཀུན་ཏུ་རྒྱུ་དག་གི་ནང་དུ་བྱུང་ནས། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་མི་ཐོས་མི་མཐོང་བ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་མི་ཐོས་ཤིང་མི་མཐོང་བས་བསྐལ་པ་འབུམ་དག་ཏུ་འཁྱམ་ཞིང་འཁོར་ཏེ། ཡུན་རིང་པོས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འཐོབ་པ་དག་ཀྱང་མཐོང་ངོ་།
en: They also saw countless bodhisattvas appearing among wandering non-Buddhist mendicants, living among them for hundreds of thousands of eons, sharing previously unheard and unseen teachings on the perfections with these mendicants who had never before heard of or seen such teachings, and then eventually attaining the state of omniscience.

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་སྟོན་པ་ཡང་མཐོང་ངོ་།
en: They also saw countless bodhisattvas teaching the perfections to other bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཚོལ་ན་ཡང་མི་རྙེད་པ་དག་ཀྱང་མཐོང་ངོ་།
en: They saw countless bodhisattvas who did not meet with the perfections, even though they searched for them.

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཚོལ་ཞིང་དེ་དག་གིས་རྙེད་པ་ཡང་མཐོང་ངོ་།
en: They also saw countless bodhisattvas who did meet with the perfections as they searched for them.

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་གང་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དག་ཀྱང་མཐོང་ངོ་།
en: They also saw countless bodhisattvas who awakened to unsurpassed and perfect buddhahood.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་གྲངས་མེད་པ་ཆོས་སྟོན་པ་དག་ཀྱང་མཐོང་ངོ་།
en: They saw countless blessed buddhas who taught the Dharma.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་གྲངས་མེད་པ་གང་དག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆེད་དུ། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོར་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་དུ་འཇུག་པར་མཛད་པ་དག་ཀྱང་མཐོང་ངོ་།
en: They saw countless blessed buddhas who, for the sake of the bodhisattvas, inspired them to arouse the mind of awakening over many trillions of eons.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་གྲངས་མེད་པ་གང་དག་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་མཛད་པ་དང་། གང་དག་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་དུ་འཇུག་པར་མཛད་པ་དག་ཀྱང་མཐོང་ངོ་།
en: They saw countless blessed buddhas who matured other beings and inspired them to arouse the mind set upon awakening.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་གྲངས་མེད་པ་གང་དག་སེམས་ཅན་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཡོངས་སུ་སྨིན་པར་མཛད་པ་དག་ཀྱང་མཐོང་ངོ་།
en: They saw countless blessed buddhas who matured as many beings as there are grains of sand in the Ganges.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་གྲངས་མེད་པ་གང་དག་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་དག་ཏུ་གཤེགས་ནས། སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་ཆོས་སྟོན་པ་དག་ཀྱང་མཐོང་ངོ་།
en: They saw countless blessed buddhas who went to countless worlds, teaching the Dharma for the sake of others.

source: །དེ་ལྟར་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་དཀའ་བ་མཛད་པའོ།
en: In this way the blessed buddhas undertook many hardships.

source: །དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དང་། དགེ་སློང་གི་དགེ་འདུན་གྱིས་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དེ་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གནས་པ་དེ་དག་ཀྱང་མཐོང་།
en: Through the Buddha’s power, Venerable Śāradvatīputra and the saṅgha of monks beheld all the bodhisattvas living in as many worlds in the eastern direction as there are grains of sand in the Ganges.

source: ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཐམས་ཅད་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་བཞུགས་པ་དེ་དག་ཀྱང་མཐོང་།
en: They also saw all the blessed buddhas present in all of those worlds in the eastern direction.

source: ལྷོ་ཕྱོགས་དང་། ནུབ་དང་། བྱང་དང་། ཕྱོགས་མཚམས་དང་། འོག་དང་། སྟེང་དུ་ཡང་དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: And then they saw the same thing in the south, the west, the north, all the intermediate directions, as well as below and above.

source: དེ་ལྟར་ཁོ་ར་ཁོར་ཡུག་ཏུ་ཕྱོགས་བཅུའི་བར་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་བཞུགས་པ་དེ་དག་མཐོང་ངོ་།
en: In this way they saw all the bodhisattva great beings and all the blessed buddhas present everywhere in the ten directions.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཆོས་རྒྱ་ཆེན་པོ་དང་ལྡན་ཏེ།
en: Venerable Śāradvatīputra said to the Blessed One, “Blessed One, the blessed buddhas truly possess a vast Dharma.

source: ཇི་ལྟ་ཞེ་ན། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མ་མཆིས་པ་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མ་མཆིས་པ་དག་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གྲངས་མ་མཆིས་པ་དག་མཐོང་བ་དང་།
en: I say this because I have seen all the countless bodhisattvas and the countless blessed buddhas present in all the boundless worlds in the eastern direction.

source: དེ་བཞིན་དུ་ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། འོག་དང་། སྟེང་དང་། ཕྱོགས་མཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མ་མཆིས་པ་དག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་དཔག་ཏུ་མ་མཆིས་པ་དང་།
en: Likewise, I have witnessed all the countless bodhisattvas and the boundless blessed buddhas present in the countless worlds in the south, the west, the north, below and above, and in all the intermediate directions.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མ་མཆིས་པ་དག་མཐོང་བ་ནི་ངོ་མཚར་ལགས་སོ།
en: It was amazing!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་རྒྱ་ཆེན་པོ་དང་ལྡན་ཏེ།
en: Venerable Śāradvatīputra now told the Blessed One, “Blessed One, in this way, the blessed buddhas and the bodhisattvas possess vast qualities.

source: གང་དག་གིས་རྒྱ་ཆེན་པོའི་གནས་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ནི་ངོ་མཚར་ལགས་སོ།
en: It is wonderful when someone arouses the mind set upon the vast object of unsurpassable awakening!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ཏེ།
en: The Blessed One said, “Śāradvatīputra, that is correct.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་འདི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་རྒྱ་ཆེན་པོ་བསྐྱེད་པར་བྱའོ། །གསོལ་པ་བཅོམ་ལྡན་འདས་མི་འགྱུར་བར་འཚལ་བས་ནི།
en: The bodhisattva great beings should engender such a vast attitude set upon unsurpassed awakening.”

source: དཔེར་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལྟར་བགྱིའོ། །ལྷར་འགྱུར་བར་འཚལ་བས་ནི།
en: Śāradvatīputra said, “Blessed One, if one desires to become a human, one should look to one such as a universal monarch.

source: དཔེར་ན་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ལྟར་བགྱིའོ། །ཚེ་རིང་བ་ཡོངས་སུ་འཛིན་པར་འཚལ་བས་ནི།
en: If one seeks to become a god, one should look to one such as Śakra, lord of the gods.

source: དཔེར་ན་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་དུ་ཉེ་བར་འགྲོ་བའི་ལྷ་རྣམས་ལྟར་བགྱིའོ།
en: If one wishes for a long life, one should look to the gods living in the field of neither perception nor non-perception.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་སྦྱིན་གནས་སུ་འགྱུར་བར་འཚལ་བ་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འབེལ་བའི་ཆོས་ཀྱི་གཏམ་བགྱི་བར་འཚལ་བ་དང་། སངས་རྒྱས་འཚལ་བས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པར་བགྱིའོ། །
en: Blessed One, likewise, if one desires to become a recipient of the world’s offerings and spread the message of the Dharma throughout the worlds of the great trichiliocosm as a buddha, one should set one’s mind on the state of omniscience.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ནོ།
en: The Blessed One said to Venerable Śāradvatīputra, “Śāradvatīputra, that is correct.

source: །དེ་དེ་བཞིན་ཏེ།
en: That is how it is.

source: འཇིག་རྟེན་གྱི་སྦྱིན་གནས་ཀྱི་མཆོག་ཏུ་འགྱུར་བར་འདོད་པས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པར་བྱའོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: If one desires to become a supreme recipient of the world’s offerings, one should arouse the attitude set upon the state of omniscience.”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དང་པོ་སེམས་བསྐྱེད་པ་འདི་ལས་གུད་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་བསྐྱེད་པ་ཆེས་བཟང་བའམ། ཆེས་རྒྱ་ཆེ་བ་འགའ་ལྟ་མཆིས་ལགས་སམ།
en: Venerable Śāradvatīputra asked the Blessed One, “Blessed One, how much better and more vast is the arousal of the mind of the bodhisattva great beings as compared to those who fail to arouse this attitude for the first time?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཡོངས་སུ་འདྲི་བར་སེམས་པ་ལེགས་སོ་ལེགས་སོ།
en: The Blessed One said, “Śāradvatīputra, it is excellent that you think to ask the thus-gone, worthy, perfect Buddha this question.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དགྲ་བཅོམ་པའི་ཟག་པ་མེད་པའི་སེམས་གང་ཡིན་པ་དེ་ནི་སྤོང་བའི་སེམས་ཀྱིས་རང་གི་རྒྱུད་དང་ལྡན་པའི་ཉོན་མོངས་པ་རྣམས་སྤང་བར་ཟད་ཀྱི།
en: Śāradvatīputra, the undefiled mind of the worthy ones merely abandons those disturbing emotions that are present in their personal mind stream by means of a relinquishing attitude.

source: སེམས་དེ་སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་ཆེད་དུ་བསྐྱེད་པ་མ་ཡིན་ནོ།
en: However, that state of mind is not produced for the sake of boundless beings.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་ཀྱི་སེམས་ནི་སེམས་ཅན་དཔག་ཏུ་མེད་པའི་ཆེད་དུ་བསྐྱེད་པ་ཡིན་གྱི། ཉི་ཚེའི་སེམས་ཅན་རྣམས་ཀྱི་ཕྱིར་ནི་མ་ཡིན་ནོ།
en: Śāradvatīputra, the mind of awakening is aroused for the sake of countless beings and not for just a limited number of beings.

source: །ཤ་ར་དྭ་ཏིའི་བུ་རང་སངས་རྒྱས་ཀྱི་སེམས་ཀྱང་རང་གི་རྒྱུད་དང་ལྡན་པའི་ཉོན་མོངས་པ་རྣམས་ཟློག་པར་ཟད་ཀྱི། བྱང་ཆུབ་ཀྱི་སེམས་ནི་སེམས་ཅན་དཔག་ཏུ་མེད་པའི་ཉོན་མོངས་པ་རྣམས་ཟློག་པ་ཡིན་ནོ།
en: Śāradvatīputra, the attitude of the solitary buddhas merely counters the disturbing emotions in one’s personal mind stream, but the mind of awakening counters the disturbing emotions of countless beings.

source: །ཤ་ར་དྭ་ཏིའི་བུ་ཡང་བྱང་ཆུབ་ཀྱི་སེམས་ནི་བསྟེན་ཅིང་བསྙེན་ཏེ་བསྒོམས་ལ་མང་དུ་བྱས་ན། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་རྣམས་ཀྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འཐོབ་བོ།
en: Śāradvatīputra, if one becomes greatly accustomed to relying on, and attending to, the mind of awakening, one will attain omniscience by means of the six perfections.

source: །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་ན། དེས་ཉན་ཐོས་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་རབ་ཏུ་ཕྱེའོ།
en: As one attains the state of omniscience, one will become exalted over the hearers and the solitary buddhas. “

source: །གང་དག་འདི་ལ་དགེ་བའི་རྩ་བ་སྐྱེད་དེ། འདི་ལྟ་སྟེ། རང་བྱང་ཆུབ་ལ་སེམས་ཤིང་སྒོམ་ན། དེ་དག་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཁྱེད་ནི་རང་སངས་རྒྱས་སུ་འགྱུར་ཏེ།
en: Whoever produces roots of virtue in this regard and becomes accustomed to the mind of awakening will receive a prophecy by the blessed buddhas, saying, ‘You will become a solitary buddha.

source: བསྐལ་པ་འདི་སྙེད་ཅིག་ན་ལྷ་རྣམས་དང་། མི་རྣམས་ཀྱི་ནང་དུ་མཚམས་སྦྱར་ཏེ་འཁོད་ནས་རང་སངས་རྒྱས་ཐོབ་པར་འགྱུར་རོ་ཞེས་ལུང་སྟོན་གྱི།
en: In such and such number of eons you will take birth among gods or men and attain the state of a solitary buddha.’

source: ཤ་ར་དྭ་ཏིའི་བུ་རང་སངས་རྒྱས་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལ་མ་འོངས་པའི་དུས་ན་ཁྱོད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་རོ། །ཞེས་ལུང་མི་སྟོན་ཏོ།
en: However, Śāradvatīputra, the solitary buddhas do not make a prophecy to the bodhisattvas, saying, ‘In the future you will become a thus-gone one, a worthy, perfect buddha.’

source: །ཉན་ཐོས་རྣམས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ལ་ལུང་མི་སྟོན་ཏོ།
en: Nor do the hearers offer a prophecy to the bodhisattvas.

source: །གལ་ཏེ་ཉན་ཐོས་ལུང་སྟོན་ན་ཡང་། དེ་བཞིན་གཤེགས་པ་ལས་ཐོས་ནས་ལུང་སྟོན་ཏོ།
en: Even if the hearers were to offer such a prophecy, they would do so because of having heard it from the Thus-Gone One.

source: །ཤ་ར་དྭ་ཏིའི་བུ་གང་གིས་སེམས་ཅན་ཐམས་ཅད་དགྲ་བཅོམ་པ་ཉིད་ལ་བཀོད་ཀྱང་། དེས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་བཟུང་བ་མ་ཡིན་གྱི།
en: Śāradvatīputra, even if someone were to establish all beings in the state of a hearer, that person would not have taken hold of the state of omniscience.

source: ཤ་ར་དྭ་ཏིའི་བུ་གང་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་རྣམས་ཀྱི་འདོམས་ཤིང་རྗེས་སུ་སྟོན་ན། འདི་ལྟར་དེས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་བཟུང་བ་ཡིན་ནོ།
en: Still, Śāradvatīputra, whoever offers a bodhisattva the teachings on the six perfections will take hold of the state of omniscience.

source: ཤ་ར་དྭ་ཏིའི་བུ་ཉན་ཐོས་ལས་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་བྱུང་བ་མ་ཡིན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་ལས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བྱང་ཆུབ་བྱུང་བའི་ཕྱིར་རོ།
en: Śāradvatīputra, the reason is that the awakening of the blessed buddhas does not manifest among the hearers; rather, the awakening of the thus-gone ones occurs among the bodhisattvas.”

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། སངས་རྒྱས་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་དྲུག་པའོ།། །།
en: This concludes the sixth chapter from “The Perfection of Generosity” entitled “The Activities of Bodhisattvas and Teachings of Buddhas in Countless Worlds.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔར་རིག་པར་བགྱི།
en: Then Venerable Śāradvatīputra asked the Blessed One, “Blessed One, how should one understand the term bodhisattva?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་མིང་འཐོབ་བོ།
en: The Blessed One replied, “Śāradvatīputra, the term bodhisattva refers to someone who trains in the six perfections. Such a being is given the name ‘bodhisattva.’”

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཟག་པ་མ་མཆིས་པའི་སེམས་ལས་བྱང་ཆུབ་ཀྱི་སེམས་ཁྱད་པར་དུ་འཕགས་པར་བཤད་པ་འདིའི་དོན་ཇི་ལྟར་འཚལ་བར་བགྱི།
en: Śāradvatīputra said, “Blessed One, how is it that the mind set upon awakening is said to be more exalted than the mind that is free of defilements?

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་ལྟར་ལུང་བསྟན་པ་བཞིན་དུ་ཡང་དག་པར་གཟུང་བར་འཚལ་ལོ།
en: I would like to understand this point based on the explanation given by the Blessed One.”
